export const tableData = {
  paracraftData: [
    {
      id: '1',
      name: '安装Paracraft和编辑模式',
      desc: '学习从官网安装Paracraft并打开3D世界<br> 学习在3D世界中移动<br> 学习在Paracraft中切换编辑或游戏模式<br> 学习测试电影积木和点击按钮'
    },
    {
      id: '2',
      name: '创建方块',
      desc: '创建方块并改变动画的背景场景'
    },
    {
      id: '3',
      name: '批量操作',
      desc: '学习批量操作，并在Paracraft的3D世界中重做和撤销'
    }
  ],
  animationData: [
    {
      id: '1',
      name: '电影方块',
      desc: '学习电影方块的使用'
    },
    {
      id: '2',
      name: '演员和动画',
      desc: '学习在Paracraft上创建演员和动画'
    },
    {
      id: '3',
      name: '夏天游泳',
      desc: '学习建造简单的场景'
    },
    {
      id: '4',
      name: 'BMAX模型 ',
      desc: '学习在三维世界中通过Bmax模型文件创建自定义模块方块'
    },
    {
      id: '5',
      name: '简易bmax小吉他',
      desc: '学习搭建静态bmax道具，并在电影中使用'
    },
    {
      id: '6',
      name: '简易bmax小动画',
      desc: '让bmax变成演员角色，并实现切镜'
    },
    {
      id: '7',
      name: '制作简易动画开头 ',
      desc: '熟练运用镜头技巧，使演员做出动作'
    },
    {
      id: '8',
      name: '动画模型方块',
      desc: '了解并掌握动画模型方块的知识以及运用，学习建造一些游戏机关'
    },
  ],
  programmeData: [
    {
      id: '1',
      name: '编程基础1',
      desc: '学会使用代码方块，并学习使用代码方块控制演员'
    },
    {
      id: '2',
      name: '编程基础2',
      desc: '学习如何创建和控制多个角色'
    },
    {
      id: '3',
      name: '乒乓球小游戏 ',
      desc: '用几行代码实现一个简单的小游戏，初步接触Paracraft的指令和控制语句'
    },
    {
      id: '4',
      name: '迷宫小游戏',
      desc: '学习使角色上下左右移动；检测是否接触；学习控制摄影机视角'
    },
    {
      id: '5',
      name: '打字练习 ',
      desc: '掌握打字技巧，提高打字速度'
    },
    {
      id: '6',
      name: '飞行的小鸟 ',
      desc: '实现一个简单的小游戏，初步接触一些指令和控制语句；练习打字'
    },
    {
      id: '7',
      name: '坦克大战',
      desc: '实现简单的坦克大战，学习角色间的事件和信息传递'
    },
    {
      id: '8',
      name: '钢琴',
      desc: '使用clone函数来克隆角色，实现有多个重复角色的游戏'
    },
    {
      id: '9',
      name: '星球运动仿真教学',
      desc: '为骨骼命名，以及电影方块中人物的放缩，学习做出简单的太阳系及八大行星的仿真运动'
    },
    {
      id: '10',
      name: '赛车小游戏',
      desc: '3D赛车游戏，方向键控制方向和加速度， ESC退出。学习使用变量控制赛车的方向和速度'
    },
    {
      id: '11',
      name: '接金币',
      desc: '学习随机函数的运用和如何获取当前鼠标位置'
    },
    {
      id: '12',
      name: '打地鼠',
      desc: '学习随机函数的运用和用电影方块来制作角色动画并在编程中调用'
    },
    {
      id: '13',
      name: '吃青蛙的怪物 ',
      desc: '学习如何实现角色随机的运动，如何传递消息等'
    },
    {
      id: '14',
      name: '弹弹堂',
      desc: '玩并体验一个比较复杂的小游戏。练习打字'
    },
    {
      id: '15',
      name: '全局变量',
      desc: '学习如何使用全局变量、如何获取用户输入'
    },
    {
      id: '16',
      name: '双重机关与事件',
      desc: '学习如何使用全局变量、如何用发布广播消息和接收广播消息'
    },
    {
      id: '17',
      name: '制作图形界面',
      desc: '制作图形界面动画、响应事件'
    },
    {
      id: '18',
      name: '代码方块的输出 ',
      desc: '实现代码方块的输出、实现不用点击开关激活方块就可以开始游戏'
    },
    {
      id: '19',
      name: '推理大师小游戏  ',
      desc: '玩推理大师小游戏，训练推理思维能力'
    },
  ],
  forwardAnimationData: [
    {
      id: '1',
      name: '四足动物与镜头震动效果',
      desc: '学习做四足动物的走路动画，以及镜头震动的效果'
    },
    {
      id: '2',
      name: 'bmax简易骨骼与X文件应用',
      desc: 'bmax骨骼应用、X文件使用方法'
    },
    {
      id: '3',
      name: '传送石、电影地震镜头与人物表现',
      desc: '实现在多个传送石之间有停留的传送、制作一个落石砸到人物的连续镜头'
    },
    {
      id: '4',
      name: '密室开头设计 ',
      desc: '学习创建解谜、密室类作品开头时的设计'
    },
    {
      id: '5',
      name: '电影方块与过山车 ',
      desc: '介绍搭建过山车与搭建过山车时运用到电影方块功能'
    },
    {
      id: '6',
      name: '子母电影方块 ',
      desc: '认识与掌握子母电影方块的功能'
    },
    {
      id: '7',
      name: '中国姓氏',
      desc: '学习用彩色方块创建中国汉字的姓氏，保存成bmax后做成汉字小动画'
    },
    {
      id: '8',
      name: '方块动画 ',
      desc: '用电影方块中的方块功能制作简单的方块小动画'
    },
    {
      id: '9',
      name: '密室教学 ',
      desc: '打造一个简单的小密室，制作机关效果'
    },
    {
      id: '10',
      name: '动画模型方块',
      desc: '了解并掌握动画模型方块的知识以及运用，学习制造一些游戏机关'
    },
  ],
  forwardProgrammeData: [
    {
      id: '1',
      name: '跳一跳',
      desc: '学习使用多个代码方块和电影方块编写复杂点的小游戏'
    },
    {
      id: '2',
      name: '电梯调度算法 ',
      desc: '通过电梯调度算法小游戏了解电梯调度的简单算法'
    },
    {
      id: '3',
      name: '由电梯调度算法了解编程思维 ',
      desc: '学习什么是抽象模型以及编程是什么样的抽象模型'
    },
    {
      id: '4',
      name: '3D世界的编程模型',
      desc: '了解3D世界这个抽象模型的要素'
    },
    {
      id: '5',
      name: '编程中的建模过程：乒乓球小游戏',
      desc: '用抽象建模的方法学习乒乓球小游戏的制作'
    },
    {
      id: '6',
      name: '编程中的建模过程：迷宫小游戏 ',
      desc: '用抽象建模的方法学习迷宫小游戏的制作'
    },
    {
      id: '7',
      name: '编程中的建模过程：钢琴 ',
      desc: '用抽象建模的方法学习钢琴小游戏的制作'
    },
    {
      id: '8',
      name: '编程中的建模过程：飞行的小鸟 ',
      desc: '用抽象建模的方法学习飞行的小鸟小游戏的制作'
    },
    {
      id: '9',
      name: '编程中的建模过程：坦克大战',
      desc: '用抽象建模的方法学习坦克大战小游戏的制作'
    },
    {
      id: '10',
      name: '编程中的建模过程：跳一跳',
      desc: '用抽象建模的方法学习跳一跳小游戏的制作'
    },
    {
      id: '11',
      name: '编程中的建模过程：赛车',
      desc: '用抽象建模的方法学习赛车小游戏的制作'
    },
    {
      id: '12',
      name: '介绍“绘图程序”小游戏 ',
      desc: '介绍“绘图程序”小游戏 '
    },
    {
      id: '13',
      name: 'Blockbot小游戏介绍 ',
      desc: '介绍BlockBot小游戏，训练如何控制指令的执行顺序'
    },
    {
      id: '14',
      name: '人力资源游戏',
      desc: '学习程序指令执行顺序的控制以及最常用的数据结构列表的各种操作'
    },
    {
      id: '15',
      name: '生命游戏',
      desc: '本课将生命游戏改编成了可以两人对弈的棋盘游戏'
    },
    {
      id: '16',
      name: '曼德勃罗特集',
      desc: '欣赏数学之美、编写绘制MandelbrotSet的核心算法代码'
    },
    {
      id: '17',
      name: '如何调试程序 ',
      desc: '学习如何调试程序'
    },
    {
      id: '18',
      name: '编程中的建模过程：推理大师小游戏',
      desc: '用抽象建模的方法学习推理大师小游戏的制作'
    },
    {
      id: '19',
      name: 'Boxboy小游戏',
      desc: '玩Boxboy小游戏，训练观察能力和推理思维'
    },
    {
      id: '20',
      name: '创意几何游戏',
      desc: '玩创意几何游戏，训练空间思维能力'
    },
    {
      id: '21',
      name: '经典游戏坦克大战',
      desc: '玩经典的坦克大战游戏，体验较复杂游戏的要素，如何让你的游戏吸引人'
    },
    {
      id: '22',
      name: '森林之王游戏',
      desc: '玩森林之王游戏，体验较复杂游戏的要素，如何让你的游戏吸引人'
    },
  ],
  highProgrammeData:[
    {
      id: '1',
      name: '编程中的建模过程：接金币 ',
      desc: '通过接金币游戏学习编程中的建模过程'
    },
    {
      id: '2',
      name: '编程中的建模过程：打地鼠 ',
      desc: '通过打地鼠游戏学习编程中的建模过程'
    },
    {
      id: '3',
      name: '编程中的建模过程：吃青蛙的怪物 ',
      desc: '通过吃青蛙的怪物游戏学习编程中的建模过程'
    },
    {
      id: '4',
      name: '编程中的建模过程：弹弹堂  ',
      desc: '通过弹弹堂游戏学习编程中的建模过程'
    },
    {
      id: '5',
      name: '复杂编程中的建模过程：电梯调度算法小游戏 ',
      desc: '通过电梯调度算法小游戏学习复杂系统的编程建模过程'
    },
    {
      id: '6',
      name: '复杂编程中的建模过程：打字小游戏 ',
      desc: '通过打字小游戏学习复杂系统的编程建模过程'
    },
    {
      id: '7',
      name: '如何制作“绘图程序”小游戏 ',
      desc: '引导学生思考如何制作“绘图程序”小游戏'
    },
    {
      id: '8',
      name: '复杂编程中的建模过程：BlockBot核心部分的制作 ',
      desc: '通过BlockBot核心部分的制作学习复杂系统的编程建模过程'
    },
    {
      id: '9',
      name: 'BlockBot小游戏-3D UI  ',
      desc: '3D UI的性质，以及如何结合代码使用'
    },
    {
      id: '10',
      name: 'BlockBot小游戏-2D UI ',
      desc: '探讨2D UI和3D UI的差异，使用2D UI实现在星座选择星星的功能'
    },
    {
      id: '11',
      name: 'BlockBot小游戏-复杂UI设计 ',
      desc: '了解管理大量UI元素的方法'
    },
    {
      id: '12',
      name: '复杂编程中的建模过程：生命游戏的制作  ',
      desc: '学习生命游戏的制作，学习复杂系统的编程建模过程'
    },
  ],
  CADData: [
    {
      id: '1',
      name: '桌子',
      desc: '学习如何使用[相减]的布尔命令'
    },
    {
      id: '2',
      name: '奥运五环 ',
      desc: '学习如何使用[复制]和[移动]的命令'
    },
    {
      id: '3',
      name: '空心的盒子',
      desc: '用npl block cad 创建一个空心的盒子，学习使用[相交]的命令'
    },
    {
      id: '4',
      name: '掷骰子',
      desc: '使用npl block cad 创建素材：骰子和碗，然后制作掷骰子的小游戏'
    },
    {
      id: '5',
      name: '万年钟',
      desc: '用CAD计算机辅助设计工具创建钟表底盘， 并用代码控制指针逻辑'
    },
    {
      id: '6',
      name: '杯子',
      desc: '使用npl block cad创建一个杯子'
    },
    {
      id: '7',
      name: '中国汉字与CAD  ',
      desc: '讲解中国汉字和名字的历史 学习NPL Block CAD命令，并创作立体文字'
    },
  ]
}
export default tableData